---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetFlangeThicknessInFlangeCenter
source: html/5e52553d-ea7b-37d8-7235-0f7a55640d07.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetFlangeThicknessInFlangeCenter Method

Returns thickness of flange measured in the 0.25 * (width - webThickess),
 sometimes used for sections with width > 300 mm.

## Syntax (C#)
```csharp
public double GetFlangeThicknessInFlangeCenter()
```